Revit 2024 API
IFCExtrusionData Constructor
 Constructs a new empty extrusion data object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IFCExtrusionData()
Visual Basic
Public Sub New
Visual C++
public:
IFCExtrusionData()
See Also
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace